wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_lptimer.h
/* LPTIMER_EIRMP */
#define LPTIMER_EIRMP_IN0RMP0               BIT(0)                              /*!< external input 0 remap, bit 0 */
#define LPTIMER_EIRMP_IN1RMP0               BIT(1)                              /*!< external input 1 remap, bit 0 */
#define LPTIMER_EIRMP_IN0RMP1_2             BITS(2,3)                           /*!< external input 0 remap, bit 1-2 */
#define LPTIMER_EIRMP_IN1RMP1_2             BITS(4,5)                           /*!< external input 1 remap, bit 1-2 */

/* LPTIMER_INHLCMV */
#define LPTIMER_INHLCMV_INHLCMVAL           BITS(0,25)                          /*!< input high level counter max value */

/* constants definitions */
/* LPTIMER init parameter struct definitions */
typedef struct {
    uint32_t clocksource;                                                       /*!< clock source */
    uint32_t prescaler;                                                         /*!< counter clock prescaler */
    uint32_t extclockpolarity;                                                  /*!< external clock polarity of the active edge for the counter */
    uint32_t extclockfilter;                                                    /*!< external clock sampling time to configure the clock glitch filter */
    uint32_t triggermode;                                                       /*!< trigger mode */
    uint32_t extriggersource;                                                   /*!< external trigger source */
    uint32_t extriggerfilter;                                                   /*!< external trigger sampling time to configure the trigger glitch filter */
    uint32_t outputpolarity;                                                    /*!< output polarity */
    uint32_t outputmode;                                                        /*!< output mode */
    uint32_t countersource;                                                     /*!< whether the counter is incremented each internal event or each external event */
} lptimer_parameter_struct;

/* clock source select */
#define LPTIMER_INTERNALCLK                 ((uint32_t)0x00000000U)             /*!< LPTIMER is clocked by internal clock source */
#define LPTIMER_EXTERNALCLK                 LPTIMER_CTL0_CKSSEL                 /*!< LPTIMER is clocked by external clock source on the LPTIMER_IN0 */

/* external clock polarity select */
#define CTL0_CKPSEL(regval)                 (BITS(1, 2) & ((uint32_t)(regval) << 1U))
#define LPTIMER_EXTERNALCLK_RISING          CTL0_CKPSEL(0)                      /*!< the rising edge is the active edge used for counting */
#define LPTIMER_EXTERNALCLK_FALLING         CTL0_CKPSEL(1)                      /*!< the falling edge is the active edge used for counting */
#define LPTIMER_EXTERNALCLK_BOTH            CTL0_CKPSEL(2)                      /*!< both edges are the active edge used for counting */

/* external clock filter select */
#define CTL0_ECKFLT(regval)                 (BITS(3, 4) & ((uint32_t)(regval) << 3U))
#define LPTIMER_EXTERNALCLK_FILTEROFF       CTL0_ECKFLT(0)                      /*!< external clock filter disabled */
#define LPTIMER_EXTERNALCLK_FILTER_2        CTL0_ECKFLT(1)                      /*!< the active level change of the external clock need to be maintained at least 2 clock periods */
#define LPTIMER_EXTERNALCLK_FILTER_4        CTL0_ECKFLT(2)                      /*!< the active level change of the external clock need to be maintained at least 4 clock periods */
#define LPTIMER_EXTERNALCLK_FILTER_8        CTL0_ECKFLT(3)                      /*!< the active level change of the external clock need to be maintained at least 8 clock periods */

/* trigger filter select */
#define CTL0_TFLT(regval)                   (BITS(6, 7) & ((uint32_t)(regval) << 6U))
#define LPTIMER_TRIGGER_FILTEROFF           CTL0_TFLT(0)                        /*!< trigger filter disabled */
#define LPTIMER_TRIGGER_FILTER_2            CTL0_TFLT(1)                        /*!< the active level change of the trigger need to be maintained at least 2 clock periods */
#define LPTIMER_TRIGGER_FILTER_4            CTL0_TFLT(2)                        /*!< the active level change of the trigger need to be maintained at least 4 clock periods */
#define LPTIMER_TRIGGER_FILTER_8            CTL0_TFLT(3)                        /*!< the active level change of the trigger need to be maintained at least 8 clock periods */

/* clock prescaler select */
#define CTL0_CLKPSC(regval)                 (BITS(9, 11) & ((uint32_t)(regval) << 9U))
#define LPTIMER_PSC_1                       CTL0_CLKPSC(0)                      /*!< no prescaler */
#define LPTIMER_PSC_2                       CTL0_CLKPSC(1)                      /*!< divided by 2 */
#define LPTIMER_PSC_4                       CTL0_CLKPSC(2)                      /*!< divided by 4 */
#define LPTIMER_PSC_8                       CTL0_CLKPSC(3)                      /*!< divided by 8 */
#define LPTIMER_PSC_16                      CTL0_CLKPSC(4)                      /*!< divided by 16 */
#define LPTIMER_PSC_32                      CTL0_CLKPSC(5)                      /*!< divided by 32 */
#define LPTIMER_PSC_64                      CTL0_CLKPSC(6)                      /*!< divided by 64 */
#define LPTIMER_PSC_128                     CTL0_CLKPSC(7)                      /*!< divided by 128 */

/* external trigger select */
#define CTL0_ETSEL(regval)                  (BITS(13, 15) & ((uint32_t)(regval) << 13U))
#define LPTIMER_EXTRIGGER_GPIO              CTL0_ETSEL(0)                       /*!< external trigger for GPIO */
#define LPTIMER_EXTRIGGER_RTCALARM0         CTL0_ETSEL(1)                       /*!< external trigger for RTC Alarm 0 */
#define LPTIMER_EXTRIGGER_RTCALARM1         CTL0_ETSEL(2)                       /*!< external trigger for RTC Alarm 1 */
#define LPTIMER_EXTRIGGER_RTCTAMP0          CTL0_ETSEL(3)                       /*!< external trigger for RTC_TAMP0 input detection */
#define LPTIMER_EXTRIGGER_RTCTAMP1          CTL0_ETSEL(4)                       /*!< external trigger for RTC_TAMP1 input detection */
#define LPTIMER_EXTRIGGER_RTCTAMP2          CTL0_ETSEL(5)                       /*!< external trigger for RTC_TAMP2 input detection */
#define LPTIMER_EXTRIGGER_CMP0_OUT          CTL0_ETSEL(6)                       /*!< external trigger for CMP0_OUT */
#define LPTIMER_EXTRIGGER_CMP1_OUT          CTL0_ETSEL(7)                       /*!< external trigger for CMP1_OUT */
#define LPTIMER_EXTRIGGER_CMP2_OUT          (CTL0_ETSEL(0)|LPTIMER_CTL0_ETSEL3) /*!< external trigger for CMP2_OUT */
#define LPTIMER_EXTRIGGER_CMP3_OUT          (CTL0_ETSEL(1)|LPTIMER_CTL0_ETSEL3) /*!< external trigger for CMP3_OUT */
#define LPTIMER_EXTRIGGER_CMP4_OUT          (CTL0_ETSEL(2)|LPTIMER_CTL0_ETSEL3) /*!< external trigger for CMP4_OUT */
#define LPTIMER_EXTRIGGER_CMP5_OUT          (CTL0_ETSEL(3)|LPTIMER_CTL0_ETSEL3) /*!< external trigger for CMP5_OUT */
#define LPTIMER_EXTRIGGER_CMP6_OUT          (CTL0_ETSEL(4)|LPTIMER_CTL0_ETSEL3) /*!< external trigger for CMP6_OUT */
#define LPTIMER_EXTRIGGER_CMP7_OUT          (CTL0_ETSEL(5)|LPTIMER_CTL0_ETSEL3) /*!< external trigger for CMP7_OUT */

/* trigger mode select */
#define CTL0_ETMEN(regval)                  (BITS(17, 18) & ((uint32_t)(regval) << 17U))
#define LPTIMER_TRIGGER_SOFTWARE            CTL0_ETMEN(0)                       /*!< external trigger disable (software trigger) */
#define LPTIMER_TRIGGER_EXTERNALRISING      CTL0_ETMEN(1)                       /*!< rising edge of external trigger enable */
#define LPTIMER_TRIGGER_EXTERNALFALLING     CTL0_ETMEN(2)                       /*!< falling edge of external trigger enable */
#define LPTIMER_TRIGGER_EXTERNALBOTH        CTL0_ETMEN(3)                       /*!< rising and falling edges of external trigger enable */

/* timeout select */
#define LPTIMER_TIMEOUT_DISABLE             ((uint32_t)0x00000000U)             /*!< a new trigger event will be ignored after LPTIMER started */
#define LPTIMER_TIMEOUT_ENABLE              LPTIMER_CTL0_TIMEOUT                /*!< a new trigger event will reset and restart the count after LPTIMER started */

