wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_lptimer.h
/* output mode select */
#define LPTIMER_OUTPUT_PWMORSINGLE          ((uint32_t)0x00000000U)             /*!< PWM mode or single pulse mode */
#define LPTIMER_OUTPUT_SET                  LPTIMER_CTL0_OMSEL                  /*!< set mode */

/* clock polarity select */
#define LPTIMER_OUTPUT_NOTINVERTED          ((uint32_t)0x00000000U)             /*!< the output is non-inverted */
#define LPTIMER_OUTPUT_INVERTED             LPTIMER_CTL0_OPSEL                  /*!< the output is inverted */

/* CAR and CMPV shadow registers enable */
#define LPTIMER_SHADOW_DISABLE              ((uint32_t)0x00000000U)             /*!< the shadow registers are disable */
#define LPTIMER_SHADOW_ENABLE               LPTIMER_CTL0_SHWEN                  /*!< the shadow registers are enable */

/* counter mode select */
#define LPTIMER_COUNTER_INTERNAL            ((uint32_t)0x00000000U)             /*!< the counter is count with each internal clock pulse */
#define LPTIMER_COUNTER_EXTERNAL            LPTIMER_CTL0_CNTMEN                 /*!< the counter is count with each active clock pulse on the LPTIMER_IN0 */

/* external input remap */
#define LPTIMER_INPUT0_GPIO                 ((uint32_t)0x00000000U)             /*!< external input 0 is remaped to GPIO */
#define LPTIMER_INPUT0_CMP0_OUT             ((uint32_t)0x00000001U)             /*!< external input 0 is remaped to CMP0_OUT */
#define LPTIMER_INPUT0_CMP2_OUT             ((uint32_t)0x00000005U)             /*!< external input 0 is remaped to CMP2_OUT */
#define LPTIMER_INPUT0_CMP4_OUT             ((uint32_t)0x00000009U)             /*!< external input 0 is remaped to CMP4_OUT */
#define LPTIMER_INPUT0_CMP6_OUT             ((uint32_t)0x0000000DU)             /*!< external input 0 is remaped to CMP6_OUT */
#define LPTIMER_INPUT1_GPIO                 ((uint32_t)0x00000000U)             /*!< external input 1 is remaped to GPIO */
#define LPTIMER_INPUT1_CMP1_OUT             ((uint32_t)0x00000002U)             /*!< external input 1 is remaped to CMP1_OUT */
#define LPTIMER_INPUT1_CMP3_OUT             ((uint32_t)0x00000012U)             /*!< external input 1 is remaped to CMP3_OUT */
#define LPTIMER_INPUT1_CMP5_OUT             ((uint32_t)0x00000022U)             /*!< external input 1 is remaped to CMP5_OUT */
#define LPTIMER_INPUT1_CMP7_OUT             ((uint32_t)0x00000032U)             /*!< external input 1 is remaped to CMP7_OUT */

/* interrupt enable or disable */
#define LPTIMER_INT_CMPVM                   LPTIMER_INTEN_CMPVMIE               /*!< compare value register match interrupt */
#define LPTIMER_INT_CARM                    LPTIMER_INTEN_CARMIE                /*!< counter auto reload register match interrupt */
#define LPTIMER_INT_ETEDEV                  LPTIMER_INTEN_ETEDEVIE              /*!< external trigger edge event interrupt */
#define LPTIMER_INT_CMPVUP                  LPTIMER_INTEN_CMPVUPIE              /*!< compare value register update interrupt */
#define LPTIMER_INT_CARUP                   LPTIMER_INTEN_CARUPIE               /*!< counter auto reload register update interrupt */
#define LPTIMER_INT_UP                      LPTIMER_INTEN_UPIE                  /*!< LPTIMER counter direction change down to up interrupt */
#define LPTIMER_INT_DOWN                    LPTIMER_INTEN_DOWNIE                /*!< LPTIMER counter direction change up to down interrupt */
#define LPTIMER_INT_HLCMVUP                 LPTIMER_INTEN_HLCMVUPIE             /*!< input high level counter max value register update interrupt */
#define LPTIMER_INT_INHLCO                  LPTIMER_INTEN_INHLCOIE              /*!< LPTIMER_INx(x=0,1) high level counter overflow interrupt */
#define LPTIMER_INT_INHLOE                  LPTIMER_INTEN_INHLOEIE              /*!< the high level of LPTIMER_IN0 and LPTIMER_IN1 overlap error interrupt */
#define LPTIMER_INT_INRFOE                  LPTIMER_INTEN_INRFOEIE              /*!< the falling and rising edges of LPTIMER_IN0 and LPTIMER_IN1 overlap error interrupt */
#define LPTIMER_INT_IN0E                    LPTIMER_INTEN_IN0EIE                /*!< LPTIMER_IN0 error interrupt */
#define LPTIMER_INT_IN1E                    LPTIMER_INTEN_IN1EIE                /*!< LPTIMER_IN1 error interrupt */

/* flag */
#define LPTIMER_FLAG_CMPVM                  LPTIMER_INTF_CMPVMIF                /*!< compare value register match flag */
#define LPTIMER_FLAG_CARM                   LPTIMER_INTF_CARMIF                 /*!< counter auto reload register match flag */
#define LPTIMER_FLAG_ETEDEV                 LPTIMER_INTF_ETEDEVIF               /*!< external trigger edge event flag */
#define LPTIMER_FLAG_CMPVUP                 LPTIMER_INTF_CMPVUPIF               /*!< compare value register update flag */
#define LPTIMER_FLAG_CARUP                  LPTIMER_INTF_CARUPIF                /*!< counter auto reload register update flag */
#define LPTIMER_FLAG_UP                     LPTIMER_INTF_UPIF                   /*!< LPTIMER counter direction change down to up flag */
#define LPTIMER_FLAG_DOWN                   LPTIMER_INTF_DOWNIF                 /*!< LPTIMER counter direction change up to down flag */
#define LPTIMER_FLAG_HLCMVUP                LPTIMER_INTF_HLCMVUPIF              /*!< input high level counter max value register update flag */
#define LPTIMER_FLAG_INHLCO                 LPTIMER_INTF_INHLCOIF               /*!< LPTIMER_INx(x=0,1) high level counter overflow flag */
#define LPTIMER_FLAG_INHLOE                 LPTIMER_INTF_INHLOEIF               /*!< the high level of LPTIMER_IN0 and LPTIMER_IN1 overlap error flag */
#define LPTIMER_FLAG_INRFOE                 LPTIMER_INTF_INRFOEIF               /*!< the falling and rising edges of LPTIMER_IN0 and LPTIMER_IN1 overlap error flag */
#define LPTIMER_FLAG_IN0E                   LPTIMER_INTF_IN0EIF                 /*!< LPTIMER_IN0 error flag */
#define LPTIMER_FLAG_IN1E                   LPTIMER_INTF_IN1EIF                 /*!< LPTIMER_IN1 error flag */

/* interrupt flag */
#define LPTIMER_INT_FLAG_CMPVM              LPTIMER_INTF_CMPVMIF                /*!< compare value register match interrupt flag */
#define LPTIMER_INT_FLAG_CARM               LPTIMER_INTF_CARMIF                 /*!< counter auto reload register match interrupt flag */
#define LPTIMER_INT_FLAG_ETEDEV             LPTIMER_INTF_ETEDEVIF               /*!< external trigger edge event interrupt flag */
#define LPTIMER_INT_FLAG_CMPVUP             LPTIMER_INTF_CMPVUPIF               /*!< compare value register update interrupt flag */
#define LPTIMER_INT_FLAG_CARUP              LPTIMER_INTF_CARUPIF                /*!< counter auto reload register update interrupt flag */
#define LPTIMER_INT_FLAG_UP                 LPTIMER_INTF_UPIF                   /*!< LPTIMER counter direction change down to up interrupt flag */
#define LPTIMER_INT_FLAG_DOWN               LPTIMER_INTF_DOWNIF                 /*!< LPTIMER counter direction change up to down interrupt flag */
#define LPTIMER_INT_FLAG_HLCMVUP            LPTIMER_INTF_HLCMVUPIF              /*!< input high level counter max value register update interrupt flag */
#define LPTIMER_INT_FLAG_INHLCO             LPTIMER_INTF_INHLCOIF               /*!< LPTIMER_INx(x=0,1) high level counter overflow interrupt flag */
#define LPTIMER_INT_FLAG_INHLOE             LPTIMER_INTF_INHLOEIF               /*!< the high level of LPTIMER_IN0 and LPTIMER_IN1 overlap error interrupt flag */
#define LPTIMER_INT_FLAG_INRFOE             LPTIMER_INTF_INRFOEIF               /*!< the falling and rising edges of LPTIMER_IN0 and LPTIMER_IN1 overlap error interrupt flag */
#define LPTIMER_INT_FLAG_IN0E               LPTIMER_INTF_IN0EIF                 /*!< LPTIMER_IN0 error interrupt flag */
#define LPTIMER_INT_FLAG_IN1E               LPTIMER_INTF_IN1EIF                 /*!< LPTIMER_IN1 error interrupt flag */

/* function declarations */
/* deinit the LPTIMER */
void lptimer_deinit(void);
/* initialize LPTIMER init parameter struct with a default value */
void lptimer_struct_para_init(lptimer_parameter_struct *initpara);
/* initialize LPTIMER counter */
void lptimer_init(lptimer_parameter_struct *initpara);
/* configure external input remap */
void lptimer_inputremap(uint32_t input0remap, uint32_t input1remap);
/* enable the LPTIMER_CAR and LPTIMER_CMPV registers shadow function */
void lptimer_register_shadow_enable(void);
/* disable the LPTIMER_CAR and LPTIMER_CMPV registers shadow function */
void lptimer_register_shadow_disable(void);
/* enable the LPTIMER TIMEOUT function */
void lptimer_timeout_enable(void);
/* disable the LPTIMER TIMEOUT function */
void lptimer_timeout_disable(void);
/* counter synchronously reset */
void lptimer_counter_sync_reset(void);
/* read cause counter asynchronously reset enable */
void lptimer_counter_read_async_reset_enable(void);
/* read cause counter asynchronously reset disable */
void lptimer_counter_read_async_reset_disable(void);    

/* LPTIMER start and stop */
/* LPTIMER start with countinue mode */
void lptimer_countinue_start(uint32_t autoreload, uint32_t compare);
/* LPTIMER start with single mode */
void lptimer_single_start(uint32_t autoreload, uint32_t compare);
/* stop LPTIMER */
void lptimer_stop(void);

/* read and configure LPTIMER register value */
/* read LPTIMER current counter value */
uint32_t lptimer_counter_read(void);
/* read LPTIMER auto reload value */
uint32_t lptimer_autoreload_read(void);
/* read the compare value */
uint32_t lptimer_compare_read(void);
/* configure LPTIMER autoreload register value */
void lptimer_autoreload_value_config(uint32_t autoreload);
/* configure LPTIMER compare value */
void lptimer_compare_value_config(uint32_t compare);

/* LPTIMER decode mode */
/* enable decode mode 0 */
void lptimer_decodemode0_enable(void);
/* enable decode mode 1 */
void lptimer_decodemode1_enable(void);
/* disable decode mode 0/1 */
void lptimer_decodemode_disable(void);

/* LPTIMER input high level counter */
/* enable external input high level counter */
void lptimer_highlevelcounter_enable(uint32_t maxvalue);
/* disable external input high level counter */
void lptimer_highlevelcounter_disable(void);

/* LPTIMER interrupt and flag */
/* get LPTIMER flags */
FlagStatus lptimer_flag_get(uint32_t flag);
/* clear LPTIMER flags */
void lptimer_flag_clear(uint32_t flag);
/* enable the LPTIMER interrupt */
void lptimer_interrupt_enable(uint32_t interrupt);
/* disable the LPTIMER interrupt */
void lptimer_interrupt_disable(uint32_t interrupt);
/* get LPTIMER interrupt flag */
FlagStatus lptimer_interrupt_flag_get(uint32_t int_flag);
/* clear LPTIMER interrupt flag */
void lptimer_interrupt_flag_clear(uint32_t int_flag);

#endif /* GD32G5X3_LPTIMER_H */
